#include "Header.h"
int main()
{
  double a[] =                     // 方程组系数矩阵
  {
   0.2368,0.2471,0.2568,1.2671,    // 第一行
   0.1968,0.2071,1.2168,0.2271,    // 第二行
   0.1581,1.1675,0.1768,0.1871,    // 第三行
   1.1161,0.1254,0.1397,0.1490     // 第四行
  };

  double b[4] =                    // 方程右端项
  { 1.8471,1.7471,1.6471,1.5471 };

  Linequ equl(4);                  // 定义一个四元方程组对象
  equl.setLinequ(a, b);            // 设置方程组

  equl.printL();                   // 输出方程组
  if (equl.Solve())                // 求解方程组
  {
    equl.showX();                  // 输出方程组的解
  }
  else
    cout << "Fail" << endl;
}